{"overall": 5.0, "vote": "9", "verified": false, "reviewTime": "11 8, 2001", "reviewerID": "AH2IFH762VY5U", "asin": "B00005N7P0", "reviewerName": "ted sedlmayr", "reviewText": "for computer enthusiast, MaxPC is a welcome sight in your mailbox. i can remember for years savorying every page of \"boot\" (as it was called in beginning) as i was (and still am) obcessed with PC's. Anyone, from advanced users - to beginners looking for knowledge - can profit from every issue of MaxPC. the icing on the cake is the subscription that comes with a CD-ROM as it is packed with demos, utilities, and other useful apps (very helpful for those not blessed with broadband connections). Until I discovered the community of hardware enthusiast web sites, MaxPC, formerly \"boot\", was my only really informative source for computing news and articles. To this day, i consider my subscription to it worth more than 10 subscriptions to most other computing mags. I can't wait until they merge with DVD media and maybe end up offering more info on Divx codecs, encoding your own movies, and best bang for the buck audio and video equipment. Try a few issues (with CD)and you may get hooked...", "summary": "AVID READER SINCE \"boot\"  WAS THE NAME", "unixReviewTime": 1005177600}
{"overall": 5.0, "vote": "9", "verified": false, "reviewTime": "10 31, 2001", "reviewerID": "AOSFI0JEYU4XM", "asin": "B00005N7P0", "reviewerName": "Amazon Customer", "reviewText": "Thank god this is not a Ziff Davis publication.  MaxPC will actually tell you if a product is bad. They will print just what they think about something; no sugar coating. I would compare their style to Car and Driver. Technical, but they know how to have a good time.", "summary": "The straight scoop", "unixReviewTime": 1004486400}
{"overall": 3.0, "vote": "14", "verified": false, "reviewTime": "03 24, 2007", "reviewerID": "A3JPFWKS83R49V", "asin": "B00005N7OJ", "style": {"Format:": " Print Magazine"}, "reviewerName": "Bryan Carey", "reviewText": "Antiques Magazine is a publication made for antique lovers and history buffs and its pages are loaded with photos of artistic paintings, handmade goods, rare pictures, and other items of similar nature. It is a magazine for those who love antiques and also those who consider themselves historians since many articles deal with historical collections of art and antiques.\n\nThis magazine is overflowing with antique goods and information. The articles contained in this magazine are intended to be visually stimulating in some cases, educational in others. They offer history lessons on the art that was popular during a specific era, a glimpse into an art collection at a museum, and more. The articles are meant to stimulate the interests of those who already like this subject and they often provide a means to learn more, to discover places to see or purchase some of the featured works, and to develop an appreciation for the craftsmanship that went into making these items.\n\nAntiques Magazine is a publication dedicated to creative art and history but one thing that isn't very creative is the titles of the articles. This might surprise some readers at first, but the editors at Antiques decided to get straight to the point in the naming of the featured articles rather than try to be creative. The features thus have titles like \"The Eating Utensil Collection\", \"Spanish Culture in Art\", etc. Each title points out exactly what the article covers, leaving nothing to the imagination.\n\nThe writing in Antiques is certainly good and well- edited. But I'm afraid that many readers will find the articles a little boring. They describe things well and they usually offer a good history lesson. But they lack spark and readability. I have tried to read some articles in this magazine and found my eyelids getting heavy and my thoughts drifting to other subjects. This is why I generally stick with the pictures when I glance at Antiques Magazine. I don't bother reading because most of the material doesn't keep my interest.\n\nOverall, Antiques Magazine is an okay publication and unless you have a deep interest in antiques and their history, you will likely become bored quickly if you try to read the articles. But the pictures in Antiques are often very interesting. Even if you have little interest in reading a magazine like this one, the photos alone make it worth an occasional look.", "summary": "Antiques Magazine is Good, but not for Everyone", "unixReviewTime": 1174694400}
{"overall": 5.0, "vote": "13", "verified": false, "reviewTime": "11 10, 2006", "reviewerID": "A19FKU6JZQ2ECJ", "asin": "B00005N7OJ", "style": {"Format:": " Print Magazine"}, "reviewerName": "Patricia L. Porada", "reviewText": "This beautiful magazine is in itself a work of art. The quality of every page and bits of information is fascinating. I see the art, the homes and read every word including the ads. I first discovered this gem in London many years ago and now it is in my home and very welcome at that.", "summary": "THE  DISCERNING READER", "unixReviewTime": 1163116800}
{"overall": 5.0, "verified": true, "reviewTime": "07 14, 2014", "reviewerID": "A25MDGOMZ2GALN", "asin": "B00005N7P0", "reviewerName": "Alvey", "reviewText": "A great read every issue.", "summary": "Five Stars", "unixReviewTime": 1405296000}
{"overall": 3.0, "verified": true, "reviewTime": "06 24, 2014", "reviewerID": "A3XT9XXWXFMJ1", "asin": "B00005N7P0", "reviewerName": "Jeff A Milne", "reviewText": "This magazine was great for the times but as with all other technology magazines the new stuff isn't as good a lot of advertisments and reviews seem biased.", "summary": "Great While it lasted", "unixReviewTime": 1403568000}
{"overall": 5.0, "verified": true, "reviewTime": "06 1, 2014", "reviewerID": "A3ERU005ES1IHT", "asin": "B00005N7P0", "reviewerName": "P. R THOMPSON", "reviewText": "I've read Maximum PC (MPC) for many years. The articles in it are not too technical and are written with light humor. That makes it very easy to read while at the same time it is imparting in-depth technical know-how.\n\n If you are a newbie, in no time you possess expert knowledge of computers and, to an extent, of electronics.\n\nIf you are already advanced, then you get even more advanced. Period.\n\nAs an MPC reader you naturally become the PC nerd amongst your friends, family, and coworkers, that everybody keeps coming to for advise and requests for help.\n\nFor instance at the launch of new operating system, such as with windows 8, and win 7, you'll get mobbed by confused hordes of PC users with a lost sense of direction.\n\nYou become their sole bastion of hope standing solidly there in the middle, that they can hold on to for guidance.\n\nThere are also little tid bits of information that can unexpectedly result in huge payoffs. In a little corner in one issue for example, they showed how to insert a check mark in my Utorrent software, that encrypted its outgoing traffic, so that my ISP couldn't invade my privacy anymore, and so had to stop bothering and threatening me about my sharing of copyrighted materials with my friends. That was a relief!\n\nI also like the fact that the magazine deals with both computer hardware, and software - though the emphasis is on hardware.\n\nThere are also letters to the computer doctor who diagnoses and then gives good advice on a range of computer illnesses and hiccups.\n\nYou also get the latest news taking place in the tech world and on copyright issues.\n\nOverall It is a well rounded publication with a little for everyone, young and old, great and small.\n\nI have the kindle for Ipad version, and it is the absolute best. Better than the Maximum PC app itself that doesn't really work.", "summary": "For Both the Newbie and The Advanced PC User", "unixReviewTime": 1401580800}
{"overall": 5.0, "verified": true, "reviewTime": "05 15, 2014", "reviewerID": "AC2278WPK3EU", "asin": "B00005N7P0", "reviewerName": "Earle Williams", "reviewText": "We ordered this magazine for our grandson (then 7 going on 30) who was/is deploy into technology. He really enjoyed every issue.", "summary": "Great Gift", "unixReviewTime": 1400112000}
{"overall": 4.0, "verified": true, "reviewTime": "03 28, 2014", "reviewerID": "A3QRR8PSCBI07C", "asin": "B00005N7P0", "reviewerName": "JJM", "reviewText": "I have subscribed to the nook version for a few years now and thoroughly enjoy this magazine. It has enough tech and what's new to keep me happy.", "summary": "Decent magazine at a good price", "unixReviewTime": 1395964800}
{"overall": 4.0, "verified": true, "reviewTime": "02 26, 2014", "reviewerID": "A5QQOOZJOVPSF", "asin": "B00005N7P0", "reviewerName": "John L. Mehlmauer", "reviewText": "I'm old, and so is my computer.  Any advice that can help me maximize my computer perfomance is very welcome.  MaximumPC has some good tips on computer parts, vendors, and usefull tests", "summary": "Cheapskates guide", "unixReviewTime": 1393372800}
{"overall": 5.0, "verified": true, "reviewTime": "01 5, 2014", "reviewerID": "A1Z16630QMH8Q6", "asin": "B00005N7P0", "reviewerName": "Vista Bill Raley", "reviewText": "At one time, this was my least favorite computer magazine. As more and more computer magazines discontinued the print editions (which i prefer), this and one other remained. When renewal time came, I asked myself, \"do I really need two ccomputer magazines\". No. One will be suficient. I decided that page for page, Maximum PC offered more useful content per page. A bonus is that if you are a 'computer geek', you'll simply 'droll' over some of the 'dream machines' Maximum PC reviews. Highly recommended.", "summary": "It grows on you!", "unixReviewTime": 1388880000}
{"overall": 2.0, "verified": true, "reviewTime": "12 11, 2013", "reviewerID": "A1LN6PL2AZGKNH", "asin": "B00005N7P0", "reviewerName": "Andrea Chambers", "reviewText": "I didn't receive a full year.  I only receive the magazine twice.  It's a good magazine, I just didn't receive it as promised.", "summary": "Maximum PC", "unixReviewTime": 1386720000}
{"overall": 5.0, "verified": true, "reviewTime": "10 30, 2013", "reviewerID": "A2FR95O3K6WZMU", "asin": "B00005N7P0", "reviewerName": "TG", "reviewText": "It was inexpensive, but now I'm getting it as an e-subscription.  Would have kept it if it had stayed at $5 - hey, can't hope that a good thing will last.  :-)  Overall, great magazine that I've subscribed to for years.", "summary": "Got the Renewal for only $5 at the time", "unixReviewTime": 1383091200}
{"overall": 5.0, "verified": true, "reviewTime": "10 2, 2013", "reviewerID": "A99B5F6XYU3CZ", "asin": "B00005N7P0", "reviewerName": "Joseph P Brown", "reviewText": "These periodicals keep me up to date on everything from Foreign Affairs to Fashion to IT. I Gotta know whatup.", "summary": "I like to read", "unixReviewTime": 1380672000}